
#Область ПрограммныйИнтерфейс 

Процедура ДополнитьФорму(Форма) Экспорт
	
	// НачалоДоработки 
	// Дополняет форму в зависимости от вида документа
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьКонтакноеЛицоВГруппаШапкаПраво(Форма);		
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" ИЛИ ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьКонтакноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента"  
		Или ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьКонтакноеЛицоНаФорму(Форма);
	КонецЕсли;
	// КонецДоработки
	
КонецПроцедуры

#КонецОбласти             

#Область СлужебныйПрограммныйИнтерфейс 

Процедура ДобавитьКонтакноеЛицоВГруппаШапкаПраво(Форма) Экспорт

	// НачалоДоработки   
	// Выводит поле "Контактное лицо" на форму документов 
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Д_КонтактноеЛицо";
	// КонецДоработки 
	
КонецПроцедуры         

Процедура ВставитьКонтакноеЛицоНаФорму(Форма) Экспорт

	// НачалоДоработки                                                                
	// Выводит поле "Контактное лицо" на форму документов      
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Д_КонтактноеЛицо";
	// КонецДоработки      
	
КонецПроцедуры

#КонецОбласти
